#pragma once

// Name: novojogo, Version: 45


#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

/*!!HELPER_DEF!!*/

/*!!DEFINE!!*/

namespace UFT
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class WireGame.WireAbilityRuleset
// 0x0010 (FullSize[0x0040] - InheritedSize[0x0030])
class UWireAbilityRuleset : public UPrimaryDataAsset
{
public:
	TArray<struct FDataTableRowHandle>                 Abilities;                                                 // 0x0030(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireAbilityRuleset");
		return ptr;
	}


	int GetIndexForAbility(class UClass* Ability);
	TArray<struct FWireAbilityData> GetAbilities();
};

// Class WireGame.WireAbilityScript
// 0x0088 (FullSize[0x00B0] - InheritedSize[0x0028])
class UWireAbilityScript : public UObject
{
public:
	float                                              CooldownTime;                                              // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CooldownTimestamp;                                         // 0x002C(0x0004) (Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AWireAbilitySystem*                          Owner;                                                     // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bRequiresClientAuth : 1;                                   // 0x0038(0x0001) BIT_FIELD  (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bServerOnly : 1;                                           // 0x0038(0x0001) BIT_FIELD  (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bNeedsCooldown : 1;                                        // 0x0038(0x0001) BIT_FIELD  (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_R630[0x77];                                    // 0x0039(0x0077) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireAbilityScript");
		return ptr;
	}


	class AActor* SpawnActor(class UClass* ActorClass, const struct FTransform& Transform, ESpawnActorCollisionHandlingMethod CollisionHandlingMethod);
	void SendClientAuth(unsigned char AbilityIndex);
	void OnServerExecute();
	void OnServerDestroy();
	void OnClientExecute();
	void OnClientDestroy();
	void OnClientAuth();
	float GetRemainingCooldownTime();
	struct FText GetCantExecuteReason();
	bool CanExecuteAbility();
};

// Class WireGame.WireAbilitySystem
// 0x0038 (FullSize[0x0280] - InheritedSize[0x0248])
class AWireAbilitySystem : public AInfo
{
public:
	TArray<class UWireAbilityScript*>                  Abilities;                                                 // 0x0248(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_Q3A9[0x8];                                     // 0x0258(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class ASQPlayerController*                         PlayerController;                                          // 0x0260(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWireAbilityRuleset*                         AbilityRuleset;                                            // 0x0268(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWireAbilityScript*                          CurrentAbility;                                            // 0x0270(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_JLND[0x8];                                     // 0x0278(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireAbilitySystem");
		return ptr;
	}


	void UseAbility(unsigned char AbilityIndex);
	void ServerUseCommanderAbility(unsigned char AbilityIndex);
	void ServerAuthAbility(unsigned char AbilityIndex);
	class UWireAbilityScript* GetAbilityFromData(const struct FWireAbilityData& AbilityData);
	void DiscardClientAuth();
	void AuthAbility(unsigned char AbilityIndex);
};

// Class WireGame.WireAmmoWidget
// 0x0008 (FullSize[0x0238] - InheritedSize[0x0230])
class UWireAmmoWidget : public USQUserWidget
{
public:
	class ASQPlayerController*                         PlayerController;                                          // 0x0230(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireAmmoWidget");
		return ptr;
	}


	void UpdateWidget(class ASQEquipableItem* CurrentWeapon);
	int GetMagazineCount(class ASQEquipableItem* Weapon);
	class ASQEquipableItem* GetCurrentWeapon();
	void ClearWidget();
};

// Class WireGame.WireAnimInstanceCosmetics
// 0x0018 (FullSize[0x0280] - InheritedSize[0x0268])
class UWireAnimInstanceCosmetics : public UAnimInstance
{
public:
	class AWireSoldier*                                Soldier;                                                   // 0x0268(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWireAnimSignificance                              Significance;                                              // 0x0270(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_IYGT[0xF];                                     // 0x0271(0x000F) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireAnimInstanceCosmetics");
		return ptr;
	}


};

// Class WireGame.WireAnimInstanceSoldier1P
// 0x0050 (FullSize[0x0D20] - InheritedSize[0x0CD0])
class UWireAnimInstanceSoldier1P : public USQAnimInstanceSoldier1P
{
public:
	class UBlendSpace1D*                               BS1D_LeftSwing_1p;                                         // 0x0CD0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlendSpace1D*                               BS1D_RightSwing_1p;                                        // 0x0CD8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlendSpace1D*                               BS1D_LeftCombo_1p;                                         // 0x0CE0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlendSpace1D*                               BS1D_RightCombo_1p;                                        // 0x0CE8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AWireMeleeWeapon*                            MeleeWeapon;                                               // 0x0CF0(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                                 FocusStaminaInfluenceCurve;                                // 0x0CF8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                                 FocusStaminaMeleeInfluenceCurve;                           // 0x0D00(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              SwayVerticalFactor;                                        // 0x0D08(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              SwayHorizontalFactor;                                      // 0x0D0C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bIsMeleeBlocking;                                          // 0x0D10(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bIsMeleeBlockingOrIsAds;                                   // 0x0D11(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_KG4O[0xE];                                     // 0x0D12(0x000E) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireAnimInstanceSoldier1P");
		return ptr;
	}


};

// Class WireGame.WireAnimInstanceSoldier3P
// 0x0080 (FullSize[0x0DB0] - InheritedSize[0x0D30])
class UWireAnimInstanceSoldier3P : public USQAnimInstanceSoldier3P
{
public:
	unsigned char                                      bEnableFootIK : 1;                                         // 0x0D30(0x0001) BIT_FIELD  (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_W5CO[0x7];                                     // 0x0D31(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UBlendSpace1D*                               BS1D_LeftSwing_Stand_3p;                                   // 0x0D38(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlendSpace1D*                               BS1D_RightSwing_Stand_3p;                                  // 0x0D40(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlendSpace1D*                               BS1D_LeftCombo_Stand_3p;                                   // 0x0D48(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlendSpace1D*                               BS1D_RightCombo_Stand_3p;                                  // 0x0D50(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlendSpace1D*                               BS1D_LeftSwing_Crouch_3p;                                  // 0x0D58(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlendSpace1D*                               BS1D_RightSwing_Crouch_3p;                                 // 0x0D60(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlendSpace1D*                               BS1D_LeftCombo_Crouch_3p;                                  // 0x0D68(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlendSpace1D*                               BS1D_RightCombo_Crouch_3p;                                 // 0x0D70(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlendSpace1D*                               BS1D_LeftSwing_Prone_3p;                                   // 0x0D78(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlendSpace1D*                               BS1D_RightSwing_Prone_3p;                                  // 0x0D80(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlendSpace1D*                               BS1D_LeftCombo_Prone_3p;                                   // 0x0D88(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlendSpace1D*                               BS1D_RightCombo_Prone_3p;                                  // 0x0D90(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AWireMeleeWeapon*                            MeleeWeapon;                                               // 0x0D98(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bIsUsingMelee;                                             // 0x0DA0(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bIsMeleeBlockingOrIsAds;                                   // 0x0DA1(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_NM8S[0xE];                                     // 0x0DA2(0x000E) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireAnimInstanceSoldier3P");
		return ptr;
	}


};

// Class WireGame.WireAnimNotify_BulletBranchPoint
// 0x0010 (FullSize[0x0048] - InheritedSize[0x0038])
class UWireAnimNotify_BulletBranchPoint : public UAnimNotify
{
public:
	struct FName                                       BulletLoopSectionName;                                     // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       EndSectionName;                                            // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireAnimNotify_BulletBranchPoint");
		return ptr;
	}


};

// Class WireGame.WireAnimNotify_ManShellEjection
// 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
class UWireAnimNotify_ManShellEjection : public UAnimNotify
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireAnimNotify_ManShellEjection");
		return ptr;
	}


};

// Class WireGame.WireAreaDamageActor
// 0x0018 (FullSize[0x0260] - InheritedSize[0x0248])
class AWireAreaDamageActor : public AActor
{
public:
	float                                              DamageInterval;                                            // 0x0248(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              IntervalDamageAmount;                                      // 0x024C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              EnteredDamageAmount;                                       // 0x0250(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bApplyEnteredDamage : 1;                                   // 0x0254(0x0001) BIT_FIELD  (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bApplyIntervalDamage : 1;                                  // 0x0254(0x0001) BIT_FIELD  (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_YFJ1[0x3];                                     // 0x0255(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UClass*                                      DamageType;                                                // 0x0258(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireAreaDamageActor");
		return ptr;
	}


};

// Class WireGame.WireCapturePointMapWidget
// 0x0038 (FullSize[0x02D8] - InheritedSize[0x02A0])
class UWireCapturePointMapWidget : public USQMapWidget
{
public:
	unsigned char                                      UnknownData_07SS[0x20];                                    // 0x02A0(0x0020) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       DisplayName;                                               // 0x02C0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       ShortName;                                                 // 0x02C8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CaptureProgress;                                           // 0x02D0(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      OwningTeam;                                                // 0x02D4(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      CapturingTeam;                                             // 0x02D5(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_A9WH[0x2];                                     // 0x02D6(0x0002) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireCapturePointMapWidget");
		return ptr;
	}


	void OnShortNameChanged();
	void OnOwningTeamChanged();
	void OnDisplayNameChanged();
	void OnCapturingTeamChanged();
	void OnCaptureProgressChanged();
	float GetFlagControlValue(int TeamID);
	void GetCapturePointScale(float* SizeX, float* SizeY);
};

// Class WireGame.WireFrontlinesCaptureMapWidget
// 0x0008 (FullSize[0x02E0] - InheritedSize[0x02D8])
class UWireFrontlinesCaptureMapWidget : public UWireCapturePointMapWidget
{
public:
	unsigned char                                      bIsFrontline : 1;                                          // 0x02D8(0x0001) BIT_FIELD  (BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_8FXX[0x7];                                     // 0x02D9(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireFrontlinesCaptureMapWidget");
		return ptr;
	}


	void OnbIsFrontlineChanged();
};

// Class WireGame.WireAssaultCaptureMapWidget
// 0x0008 (FullSize[0x02E8] - InheritedSize[0x02E0])
class UWireAssaultCaptureMapWidget : public UWireFrontlinesCaptureMapWidget
{
public:
	int                                                BoundaryAtlasIndex;                                        // 0x02E0(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                BoundaryAtlasDivisions;                                    // 0x02E4(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireAssaultCaptureMapWidget");
		return ptr;
	}


	void OnBoundaryAtlasIndexChanged();
};

// Class WireGame.WireCapturePoint
// 0x0090 (FullSize[0x02D8] - InheritedSize[0x0248])
class AWireCapturePoint : public AActor
{
public:
	unsigned char                                      UnknownData_7ME7[0x28];                                    // 0x0248(0x0028) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       ShortName;                                                 // 0x0270(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FName                                       DisplayName;                                               // 0x0278(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USQCoreStateComponent*                       StateComponent;                                            // 0x0280(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClass*                                      SceneWidgetClass;                                          // 0x0288(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MaxCaptureRate;                                            // 0x0290(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              PlayerCaptureRate;                                         // 0x0294(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              ResetCaptureRate;                                          // 0x0298(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              CaptureProgress;                                           // 0x029C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScriptMulticastDelegate                    OnOwningTeamChanged;                                       // 0x02A0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnCapturingTeamChanged;                                    // 0x02B0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnTeamCaptureRulesChanged;                                 // 0x02C0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	unsigned char                                      MinimimCaptureThreshold;                                   // 0x02D0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      InitialOwningTeam;                                         // 0x02D1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      OwningTeam;                                                // 0x02D2(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      CapturingTeam;                                             // 0x02D3(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_D66F[0x1];                                     // 0x02D4(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      TeamCaptureRules;                                          // 0x02D5(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      bResetProgressWhenEmpty : 1;                               // 0x02D6(0x0001) BIT_FIELD  (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      bIsActive : 1;                                             // 0x02D6(0x0001) BIT_FIELD  (Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_LZS3[0x1];                                     // 0x02D7(0x0001) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireCapturePoint");
		return ptr;
	}


	void OnRep_TeamCaptureRules(unsigned char OldState);
	void OnRep_OwningTeam(unsigned char OldState);
	void OnRep_CapturingTeam(unsigned char OldState);
	void OnRep_CaptureProgress(float OldValue);
	bool GetTeamCanCapture(unsigned char TeamID);
	float GetFlagControlValue(unsigned char InTeam);
};

// Class WireGame.WireFrontlinesCapturePoint
// 0x0010 (FullSize[0x02E8] - InheritedSize[0x02D8])
class AWireFrontlinesCapturePoint : public AWireCapturePoint
{
public:
	class UTexture2D*                                  CapturePointMaskTexture;                                   // 0x02D8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_DKYX[0x8];                                     // 0x02E0(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireFrontlinesCapturePoint");
		return ptr;
	}


	class AWireFrontlinesSector* GetOwningSector();
};

// Class WireGame.WireAssaultCapturePoint
// 0x0008 (FullSize[0x02F0] - InheritedSize[0x02E8])
class AWireAssaultCapturePoint : public AWireFrontlinesCapturePoint
{
public:
	unsigned char                                      bAllowDefenderCapture : 1;                                 // 0x02E8(0x0001) BIT_FIELD  (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_X6N1[0x7];                                     // 0x02E9(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireAssaultCapturePoint");
		return ptr;
	}


};

// Class WireGame.WireGameMode
// 0x0008 (FullSize[0x0730] - InheritedSize[0x0728])
class AWireGameMode : public ASQGameMode
{
public:
	class UClass*                                      NotifyWidgetClass;                                         // 0x0728(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireGameMode");
		return ptr;
	}


};

// Class WireGame.WireFrontlinesGameMode
// 0x0010 (FullSize[0x0740] - InheritedSize[0x0730])
class AWireFrontlinesGameMode : public AWireGameMode
{
public:
	unsigned char                                      UnknownData_4TBB[0x10];                                    // 0x0730(0x0010) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireFrontlinesGameMode");
		return ptr;
	}


	void OnGraphLatticeUpdated();
	class AWireBaseRulesetState* GetRulesetState();
	void CreateCaptureMarkers();
};

// Class WireGame.WireAssaultGameMode
// 0x0000 (FullSize[0x0740] - InheritedSize[0x0740])
class AWireAssaultGameMode : public AWireFrontlinesGameMode
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireAssaultGameMode");
		return ptr;
	}


};

// Class WireGame.WireFrontlinesGraphActor
// 0x0068 (FullSize[0x0300] - InheritedSize[0x0298])
class AWireFrontlinesGraphActor : public ASQAASGraph
{
public:
	class UWireFrontlinesGraphInitializer*             GraphInitializer;                                          // 0x0298(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      WhistleSoundCue[0x28];                                     // 0x02A0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty WireGame.WireFrontlinesGraphActor.WhistleSoundCue
	unsigned char                                      UnknownData_LEGJ[0x10];                                    // 0x02C8(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FScriptMulticastDelegate                    OnGraphUpdated;                                            // 0x02D8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_T41O[0x18];                                    // 0x02E8(0x0018) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireFrontlinesGraphActor");
		return ptr;
	}


	void SectorStateChanged(class UWireFrontlinesGraphNodeComponent* NodeComponent, unsigned char WinningTeam);
	void MulticastGraphUpdated(class AWireFrontlinesSector* Sector, unsigned char WinningTeam);
	TArray<class AWireFrontlinesSector*> GetAllSectors();
};

// Class WireGame.WireAssaultGraphActor
// 0x0030 (FullSize[0x0330] - InheritedSize[0x0300])
class AWireAssaultGraphActor : public AWireFrontlinesGraphActor
{
public:
	unsigned char                                      CapturePointRendererClass[0x28];                           // 0x0300(0x0028) UNKNOWN PROPERTY: SoftClassProperty WireGame.WireAssaultGraphActor.CapturePointRendererClass
	class AWireCapturePointBoundaryRenderer*           CapturePointRenderer;                                      // 0x0328(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireAssaultGraphActor");
		return ptr;
	}


};

// Class WireGame.WireFrontlinesGraphNodeComponent
// 0x0010 (FullSize[0x0160] - InheritedSize[0x0150])
class UWireFrontlinesGraphNodeComponent : public USQGraphNodeComponent
{
public:
	struct FScriptMulticastDelegate                    OnSectorStateChanged;                                      // 0x0150(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireFrontlinesGraphNodeComponent");
		return ptr;
	}


	void UpdateCaptureState(class UWireFrontlinesGraphNodeComponent* NodeComponent, unsigned char WinningTeam);
	void OnGraphInitialized();
};

// Class WireGame.WireAssaultGraphNodeComponent
// 0x0000 (FullSize[0x0160] - InheritedSize[0x0160])
class UWireAssaultGraphNodeComponent : public UWireFrontlinesGraphNodeComponent
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireAssaultGraphNodeComponent");
		return ptr;
	}


};

// Class WireGame.WirePlayableArea
// 0x0028 (FullSize[0x0270] - InheritedSize[0x0248])
class AWirePlayableArea : public AActor
{
public:
	float                                              BuffApplyTime;                                             // 0x0248(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      AllowedTeam;                                               // 0x024C(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_5MF1[0x3];                                     // 0x024D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FScriptMulticastDelegate                    OnAllowedTeamChanged;                                      // 0x0250(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_CD7M[0x10];                                    // 0x0260(0x0010) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WirePlayableArea");
		return ptr;
	}


	void OnRep_AllowedTeam();
	float GetRemainingBuffTime();
};

// Class WireGame.WireFrontlinesPlayableArea
// 0x0060 (FullSize[0x02D0] - InheritedSize[0x0270])
class AWireFrontlinesPlayableArea : public AWirePlayableArea
{
public:
	unsigned char                                      OwningSector[0x28];                                        // 0x0270(0x0028) UNKNOWN PROPERTY: SoftObjectProperty WireGame.WireFrontlinesPlayableArea.OwningSector
	unsigned char                                      PrepBlockingActor[0x28];                                   // 0x0298(0x0028) UNKNOWN PROPERTY: SoftObjectProperty WireGame.WireFrontlinesPlayableArea.PrepBlockingActor
	unsigned char                                      UnknownData_P48T[0x10];                                    // 0x02C0(0x0010) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireFrontlinesPlayableArea");
		return ptr;
	}


	void OnSectorStateChanged();
	void OnEnteredPlayingStage();
};

// Class WireGame.WireAssaultPlayableArea
// 0x0008 (FullSize[0x02D8] - InheritedSize[0x02D0])
class AWireAssaultPlayableArea : public AWireFrontlinesPlayableArea
{
public:
	unsigned char                                      UnknownData_PN35[0x8];                                     // 0x02D0(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireAssaultPlayableArea");
		return ptr;
	}


};

// Class WireGame.WireBaseGameRuleset
// 0x0078 (FullSize[0x0328] - InheritedSize[0x02B0])
class AWireBaseGameRuleset : public ASQAASRuleset
{
public:
	float                                              PreparationDuration;                                       // 0x02B0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              PlayingDuration;                                           // 0x02B4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                TicketBleedAmount;                                         // 0x02B8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_CBYM[0x4];                                     // 0x02BC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TMap<EWireGameMatchState, struct FText>            MatchStateMessages;                                        // 0x02C0(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	unsigned char                                      bIsTieBreaker : 1;                                         // 0x0310(0x0001) BIT_FIELD  (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bAllSectorsCaptured : 1;                                   // 0x0310(0x0001) BIT_FIELD  (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_UBZR[0x17];                                    // 0x0311(0x0017) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireBaseGameRuleset");
		return ptr;
	}


};

// Class WireGame.WireFrontlinesRuleset
// 0x0008 (FullSize[0x0330] - InheritedSize[0x0328])
class AWireFrontlinesRuleset : public AWireBaseGameRuleset
{
public:
	float                                              OvertimeDuration;                                          // 0x0328(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      MaxMatchPhases;                                            // 0x032C(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_UEXI[0x3];                                     // 0x032D(0x0003) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireFrontlinesRuleset");
		return ptr;
	}


};

// Class WireGame.WireAssaultRuleset
// 0x0068 (FullSize[0x0398] - InheritedSize[0x0330])
class AWireAssaultRuleset : public AWireFrontlinesRuleset
{
public:
	float                                              StartingTimelimit;                                         // 0x0330(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              SectorCaptureAddTime;                                      // 0x0334(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              OvertimeAddTime;                                           // 0x0338(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MaxTime;                                                   // 0x033C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ZHLG[0x8];                                     // 0x0340(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TMap<EWireGameMatchState, struct FText>            MatchStateMessagesDefenders;                               // 0x0348(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireAssaultRuleset");
		return ptr;
	}


};

// Class WireGame.WireBaseRulesetState
// 0x0020 (FullSize[0x0268] - InheritedSize[0x0248])
class AWireBaseRulesetState : public ASQRulesetState
{
public:
	float                                              StateTimestamp;                                            // 0x0248(0x0004) (Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWireGameMatchState                                MatchState;                                                // 0x024C(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_A42L[0x1B];                                    // 0x024D(0x001B) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireBaseRulesetState");
		return ptr;
	}


	void OnRep_MatchState(EWireGameMatchState OldMatchState);
	float GetRemainingPrepTime();
	float GetRemainingMatchTime();
};

// Class WireGame.WireAssaultRulesetState
// 0x0008 (FullSize[0x0270] - InheritedSize[0x0268])
class AWireAssaultRulesetState : public AWireBaseRulesetState
{
public:
	float                                              ReplicatedTimePool;                                        // 0x0268(0x0004) (Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_5PS3[0x4];                                     // 0x026C(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireAssaultRulesetState");
		return ptr;
	}


	unsigned char GetAttackingTeam();
};

// Class WireGame.WireFrontlinesSector
// 0x00E0 (FullSize[0x0328] - InheritedSize[0x0248])
class AWireFrontlinesSector : public AActor
{
public:
	class UWireFrontlinesGraphNodeComponent*           NodeComponent;                                             // 0x0248(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USQCoreStateComponent*                       StateComponent;                                            // 0x0250(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      SceneWidgetClass;                                          // 0x0258(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      GraphActorPtr[0x28];                                       // 0x0260(0x0028) UNKNOWN PROPERTY: SoftObjectProperty WireGame.WireFrontlinesSector.GraphActorPtr
	unsigned char                                      CapturePointPtrs[0x10];                                    // 0x0288(0x0010) UNKNOWN PROPERTY: ArrayProperty WireGame.WireFrontlinesSector.CapturePointPtrs
	struct FName                                       SectorName;                                                // 0x0298(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      InitialTeam;                                               // 0x02A0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      LastOwningTeam;                                            // 0x02A1(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      OwningTeam;                                                // 0x02A2(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_QYXT[0x1];                                     // 0x02A3(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      bIsMainBase : 1;                                           // 0x02A4(0x0001) BIT_FIELD  (Edit, BlueprintVisible, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      bHasBegunPlay : 1;                                         // 0x02A4(0x0001) BIT_FIELD  (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_U43H[0x3];                                     // 0x02A5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	uint32_t                                           TeamCapturabilities;                                       // 0x02A8(0x0004) (Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_CX4I[0x64];                                    // 0x02AC(0x0064) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FScriptMulticastDelegate                    OnPostSectorStateChanged;                                  // 0x0310(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_JM08[0x8];                                     // 0x0320(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireFrontlinesSector");
		return ptr;
	}


	void OnRep_TeamCapturabilities();
	void OnRep_OwningTeam(unsigned char LastTeam);
	void OnIndexedTeamStatesReplicated();
	float GetSectorCaptureValue(int InTeamId);
	bool GetIsFrontlineSector();
	TArray<class AWireFrontlinesCapturePoint*> GetAllCapturePoints();
};

// Class WireGame.WireAssaultSector
// 0x0068 (FullSize[0x0390] - InheritedSize[0x0328])
class AWireAssaultSector : public AWireFrontlinesSector
{
public:
	unsigned char                                      UnknownData_KRI2[0x68];                                    // 0x0328(0x0068) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireAssaultSector");
		return ptr;
	}


};

// Class WireGame.WireFrontlinesSpawnGroup
// 0x0030 (FullSize[0x0420] - InheritedSize[0x03F0])
class AWireFrontlinesSpawnGroup : public ASQTeamSpawnGroup
{
public:
	unsigned char                                      ParentSectorPtr[0x28];                                     // 0x03F0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty WireGame.WireFrontlinesSpawnGroup.ParentSectorPtr
	ESQTeam                                            SpawnTeam;                                                 // 0x0418(0x0001) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_W457[0x7];                                     // 0x0419(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireFrontlinesSpawnGroup");
		return ptr;
	}


};

// Class WireGame.WireAssaultSpawnGroup
// 0x0008 (FullSize[0x0428] - InheritedSize[0x0420])
class AWireAssaultSpawnGroup : public AWireFrontlinesSpawnGroup
{
public:
	EWireAssaultSpawnGroupType                         SpawnGroupType;                                            // 0x0420(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_9B7L[0x7];                                     // 0x0421(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireAssaultSpawnGroup");
		return ptr;
	}


};

// Class WireGame.WireAssetManager
// 0x0008 (FullSize[0x0440] - InheritedSize[0x0438])
class UWireAssetManager : public UAssetManager
{
public:
	unsigned char                                      UnknownData_CDCS[0x8];                                     // 0x0438(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireAssetManager");
		return ptr;
	}


};

// Class WireGame.WireBuffManager
// 0x0000 (FullSize[0x00F8] - InheritedSize[0x00F8])
class UWireBuffManager : public USQBuffManager
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireBuffManager");
		return ptr;
	}


};

// Class WireGame.WireCapturePointBoundaryRenderer
// 0x0050 (FullSize[0x0298] - InheritedSize[0x0248])
class AWireCapturePointBoundaryRenderer : public AActor
{
public:
	class USceneCaptureComponent2D*                    CaptureCamera;                                             // 0x0248(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                        BrushMesh;                                                 // 0x0250(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                              RenderScale;                                               // 0x0258(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              RenderPaddingPercent;                                      // 0x025C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                          BrushMeshMaterial;                                         // 0x0260(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMesh*                                 CubeMesh;                                                  // 0x0268(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMesh*                                 SphereMesh;                                                // 0x0270(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextureRenderTarget2D*                      BlitterRenderTarget;                                       // 0x0278(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextureRenderTarget2D*                      AtlasRenderTarget;                                         // 0x0280(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                          BlittingMaterial;                                          // 0x0288(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*                    BlittingMaterialDynInst;                                   // 0x0290(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireCapturePointBoundaryRenderer");
		return ptr;
	}


};

// Class WireGame.WireCapturePointInterface
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
class UWireCapturePointInterface : public UInterface
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireCapturePointInterface");
		return ptr;
	}


};

// Class WireGame.WireCapturePointStateData
// 0x0018 (FullSize[0x0198] - InheritedSize[0x0180])
class UWireCapturePointStateData : public USQSquadStateMapData
{
public:
	struct FName                                       DisplayName;                                               // 0x0180(0x0008) (Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       ShortName;                                                 // 0x0188(0x0008) (Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CaptureProgress;                                           // 0x0190(0x0004) (Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      OwningTeam;                                                // 0x0194(0x0001) (Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      CapturingTeam;                                             // 0x0195(0x0001) (Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_WTSU[0x2];                                     // 0x0196(0x0002) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireCapturePointStateData");
		return ptr;
	}


};

// Class WireGame.WireCaptureScoreRuleset
// 0x0008 (FullSize[0x0278] - InheritedSize[0x0270])
class AWireCaptureScoreRuleset : public ASQGameRuleSet
{
public:
	unsigned char                                      bNotifyOnCapture : 1;                                      // 0x0270(0x0001) BIT_FIELD  (Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      bNotifyOnCapturing : 1;                                    // 0x0270(0x0001) BIT_FIELD  (Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_FFCM[0x7];                                     // 0x0271(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WireGame.WireCaptureScoreRuleset");
		return ptr;
	}


	void PointCapturing(class AWireCapturePoint* CapturePoint);
	void PointCaptured(class AWireCapturePoint* CapturePoint);
	void OnNotifyCapturing(class APlayerController* PC, class AWireCapturePoint* CapturePoint);
	void OnNotifyCaptured(class APlayerController* PC, class AWireCapturePoint* CapturePoint);
};

// Class WireGame.WireChunkSettings
// 0x0020 (FullSize[0x0058] - InheritedSize[0x0038])
class UWireChunkSettings : public UDeveloperSettings
{
public:
	unsigned char                                      MapsToCook[0x10];                                          // 0x0038(0x0010) UNKNOWN PROPERTY: ArrayProperty WireGame.WireChunkSettings.MapsToCook
